configuration/src/Catalogs/Филиалы/Филиалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Филиалы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>КастомныеКоманды</name>
      <description>Кастомные команды</description>
    </items>
  </predefined>
  <attributes>
    <name>ITСтруктура</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаместительРуководителя</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Территория</name>
    <type>
      <types>CatalogRef.Территории</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФилиала</name>
    <type>
      <types>EnumRef.ТипыФилиалов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленВИсточнике</name>
    <comment>Устанавливается в Истину, если обменом пришло Удаление объекта.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОбщийКаналRocketChat</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеЛицо</name>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИерархияТерриторий</name>
    <attributes>
      <name>Территория</name>
      <type>
        <types>CatalogRef.Территории</types>
      </type>
    </attributes>
    <attributes>
      <name>Уровень</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазрабатываемыеСистемы</name>
    <attributes>
      <name>Система</name>
      <type>
        <types>CatalogRef.СистемыУчета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/InformationRegisters/НастройкиФилиалов/НастройкиФилиалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиФилиалов</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ВидыНастроекФилиалов</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор последнего изменения</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <comment>Дата и время последнего изменения</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Филиал</name>
    <comment>Владелец настройки</comment>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыНастроекФилиалов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/ТипыФилиалов/ТипыФилиалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыФилиалов</name>
  <enumValues>
    <name>IT</name>
  </enumValues>
  <enumValues>
    <name>НеIT</name>
  </enumValues>
  <enumValues>
    <name>QA</name>
  </enumValues>
</mdclass:Enum>

configuration/src/ChartsOfCharacteristicTypes/ВидыНастроекФилиалов/ВидыНастроекФилиалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыНастроекФилиалов</name>
  <type>
    <types>CatalogRef.Филиалы</types>
    <types>CatalogRef.ЮридическиеЛица</types>
    <types>CatalogRef.ВидыЗадач</types>
    <types>Boolean</types>
    <types>CatalogRef.НаправленияРазработки</types>
    <types>CatalogRef.Процессы</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.СистемыУчета</types>
    <types>CatalogRef.НазначенияЗадач</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>2</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>200</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>КонтрольКачества</name>
      <description>Настройки тестирования</description>
      <code>000000028</code>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>Основное</name>
      <description>Основное</description>
      <code>000000053</code>
    </items>
    <items>
      <name>ПроцессРазработки</name>
      <description>Процесс разработки</description>
      <code>000000006</code>
      </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>Прочее</name>
      <description>Прочее</description>
      <code>000000004</code>
    </items>
    <items>
      <name>СотрудникиФилиала</name>
      <description>Сотрудники филиала</description>
      <code>000000047</code>
    </items>
    <items>
      <name>Трудозатраты</name>
      <description>Трудозатраты</description>
      <code>000000001</code>
      </content>
      </content>
    </items>
  </predefined>
  <attributes>
    <name>ВариантГруппировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйРеквизит</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыНастроекФилиалов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСписокВыбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьЗаголовок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьКакПодраздел</name>
    <comment>Истина - будет группа будет представлена подразделом. Ложь - будетотображена как группа с заголовком на родительской странице</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <comment>Текст подсказки, которая будет отображаться в виде контекстной подсказки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокСледования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Скрытый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранятьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПерезапуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокВыбора</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ВидыНастроекФилиалов</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыФилиалов</name>
    <attributes>
      <name>ТипФилиала</name>
      <type>
        <types>EnumRef.ТипыФилиалов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

configuration/src/Catalogs/Филиалы/Forms/ФормаВыбора/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВыборКоманды") Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
		ЭтотОбъект.АвтоЗаголовок = Ложь;
		ЭтотОбъект.Заголовок = "Команды разработчиков";
	ИначеЕсли Параметры.Свойство("УстановитьСписок") Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоФилиалыСНаправлением") Тогда
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Филиалы.Ссылка КАК Филиал
		|ИЗ
		|	Справочник.Филиалы КАК Филиалы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиФилиалов КАК НастройкиФилиалов
		|		ПО Филиалы.Ссылка = НастройкиФилиалов.Филиал
		|			И (НастройкиФилиалов.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыНастроекФилиалов.НаправлениеРазработки))
		|			И (НастройкиФилиалов.Значение <> ЗНАЧЕНИЕ(Справочник.НаправленияРазработки.ПустаяСсылка))
		|ГДЕ
		|	Филиалы.Родитель = ЗНАЧЕНИЕ(Справочник.Филиалы.ПустаяСсылка)
		|	И НЕ Филиалы.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА &ТолькоIT
		|				ТОГДА Филиалы.ТипФилиала <> ЗНАЧЕНИЕ(Перечисление.ТипыФилиалов.НеIT)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
		
		ТолькоIT = Параметры.Свойство("ТолькоIT") И Параметры.ТолькоIT;
		
		Запрос.УстановитьПараметр("ТолькоIT", ТолькоIT);
		
		Результат = Запрос.Выполнить().Выгрузить();
		СписокФилиал = Новый СписокЗначений;
		СписокФилиал.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("Филиал"));
		
		ЭлементОтбора = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение = СписокФилиал; 
	КонецЕсли;

	ЭтоАдминистратор = УправлениеДоступомПовтИсп.ПроверитьДоступностьРоли("Администратор");
	Список.Параметры.УстановитьЗначениеПараметра("ЭтоАдминистратор", ЭтоАдминистратор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки, ИспользуютсяСтандартныеНастройки)
	
	// Форма может открываться с фиксированными настройками отбора. 
	// Чтобы при пересечении этих отборов с пользовательскими не возникало исключения, 
	// необходимо удалить пересекающиеся пользовательские отборы.  
	
	// Удаление пользовательских настроек, конфликтующих с отборами, добавленными при создании формы выбора
	РаботаСНастройками.УдалитьКонфликтующиеНастройкиДинамическогоСписка(Настройки, Список.КомпоновщикНастроек.ФиксированныеНастройки);
	// Удаление пользовательских настроек, конфликтующих с отборами в фиксированных настройках, переданных в параметры формы
	РаботаСНастройками.УдалитьКонфликтующиеНастройкиДинамическогоСписка(Настройки, Параметры.ФиксированныеНастройки);
	
КонецПроцедуры
	
#КонецОбласти
